Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Change the working directory (@WorkingDir) back to the location of the script directory as FileOpenDialog sets it to the last accessed folder.
fr: Change le répertoire de travail (@WorkingDir) vers l'emplacement du répertoire de script comme FileOpenDialog l'a défini au dernier dossier consulté.

source: Replace instances of "|" with @CRLF in the string returned by FileOpenDialog.
fr: Remplace les instances de "|" avec CRLF dans la chaîne renvoyée par FileOpenDialog.

source: Display the list of selected files.
fr: Affiche la liste des fichiers sélectionnés.

source: Display an open dialog to select a file.
fr: Ouvre une boîte de dialogue pour sélectionner un fichier.

source: Display the selected file.
fr: Affiche le fichier sélectionné.

source: The number of characters to read.
fr: Le nombre de caractères à lire.

source: the binary/string read.
fr: Retourne le binaire/la chaine de caractères lue.

source: @extended is set to the number of bytes/characters returned.
fr: @extended est défini sur le nombre d'octets/de caractères retournés.

source: 1 = if file not opened in read mode or other error
fr: 1 = si le fichier n'est pas ouvert en mode lecture ou pour les autres erreurs.

source: -1 = if end-of-file is reached
fr: -1 = si fin de fichier est atteinte

source: A negative or not defined count, reads the whole file from the current position.
fr: Un nombre négatif ou non défini, lit le fichier entier à partir de la position courante.

source: If a filename is given rather than a file handle - the file will be opened and closed during the function call - for parsing large files this will be much slower than using filehandles.
fr: Si un nom de fichier est donné plutôt qu'un handle de fichier - le fichier sera ouvert et fermé durant l'appel de fonction - pour analyser des fichiers texte de grande taille ce sera beaucoup plus lent que d'utiliser des handles de fichiers.

source: Both ANSI and UTF16/UTF8 formats can be read - AutoIt will automatically determine the type.
fr: Les deux formats de texte ANSI et UTF16/UTF8 peuvent être lus - AutoIt va automatiquement déterminer le type.

source: A file can be read as binary (byte) data by using FileOpen() with the binary flag - in this case count is in bytes rather than characters.
fr: Un fichier peut être lu comme binaire (octet) de données en utilisant FileOpen() avec l'option binaire - dans ce cas le comptage est en octets plutôt qu'en caractères.

source: A count value that is too large can lead to AutoIt stopping with a memory allocation failure.
fr: Un nombre trop grand peut provoquer l'arrêt de AutoIt avec une erreur d'allocation mémoire.

source: [optional]The line number to read.
fr: [optional] Le numéro de la ligne à lire.

source: The first line of a text file is line 1 (not zero), last line is -1.
fr: La première ligne du fichier texte est la ligne 1 (pas zéro), la dernière ligne est -1.

source: a line of text.
fr: Retourne une ligne de texte

source: Returns the text of the line read, any newline characters ( Chr(10) or @LF ) at the end of a line read in are automatically stripped.
fr: Retourne le texte de la ligne lue, tous les caractères de saut de ligne (Chr(10) ou @LF) à la fin d'une ligne lue sont automatiquement supprimés.

source: If no line number to read is given, the "next" line will be read.
fr: Si aucun numéro de ligne à lire est donné, la ligne "suivante" sera lue.

source: ("Next" for a newly opened file is initially the first line.)
fr: (La "suivante" pour un fichier nouvellement ouvert est la première ligne.)

source: If a filename is given rather than a file handle - the file will be opened and closed during the function call - for parsing large text files this will be much slower than using filehandles.
fr: Si un nom de fichier est donné plutôt qu'un handle de fichier - le fichier sera ouvert et fermé pendant l'appel de fonction - pour traiter des fichiers texte volumineux ce sera beaucoup plus lent que d'utiliser des handles de fichiers.

source: From a performance standpoint it is a bad idea to read line by line specifying "line" parameter whose value is incrementing by one.
fr: Du point de vue performance ce serait une mauvaise idée de lire ligne par ligne en spécifiant le paramètre "line" dont la valeur serait incrémentée de un.

source: This forces AutoIt to reread the file from the beginning until it reach the specified line.
fr: Ceci forcerait AutoIt à relire le fichier depuis le début jusqu'à atteindre la ligne spécifiée.

source: Both ANSI and UTF16/UTF8 text formats can be read - AutoIt will automatically determine the type.
fr: Les deux formats de texte ANSI et UTF16/UTF8 peuvent être lus - AutoIt détermine automatiquement le type.

source: Read the fist line of the file using the handle returned by FileOpen.
fr: Lit la 1ère ligne du fichier en utilisant le handle renvoyé par FileOpen.

source: Display the first line of the file.
fr: Affiche la première ligne du fichier.

source: a 1 dimension array containing one line of text per element.
fr: Retourne un tableau à 1 dimension contenant une ligne de texte par élément.

source: sets the @error flag to non_zero.
fr: Retourne @error <> 0.

source: 1 = Error opening specified file
fr: 1 = Erreur à l'ouverture du fichier

source: 2 = Empty file
fr: 2 = Fichier vide

source: Use UBound() to determine the number of lines read.
fr: Utiliser UBound() pour déterminer le nombre de lignes lues.

source: Read the current script file into an array using the filepath.
fr: Lit le fichier du script courant dans un tableau en utilisant le chemin du fichier.

source: An error occurred reading the current script file.
fr: Une erreur s'est produite lecture du fichier de script courant.

source: Loop through the array.
fr: Boucle dans le tableau.

source: Display the contents of the array.
fr: Affiche le contenu du tableau.

source: The source path of the file(s) or directory to Recycle.
fr: Le chemin source du/des fichier(s) ou répertoire(s) à recycler.

source: (* and ?wildcards accepted - See Remarks)
fr: Les caractères spéciaux sont pris en charge.

source: 0 (typically meaning the file is in use or does not exist).
fr: Retourne 0 (généralement signifie que le fichier est utilisé ou n'existe pas).

source: To remove a directory, simply give the path without a trailing backslash.
fr: Pour supprimer un répertoire, il suffit de donner le chemin d'accès sans contre-slash à la fin.

source: Delete the temporary file by sending to the recycle bin.
fr: Supprime le fichier temporaire en l'envoyant à la corbeille.

source: Display a message of whether the file was deleted and open the recycle bin if successful.
fr: Affiche un message si le fichier a été supprimé et ouvre la corbeille en cas de succès.

source: Open the recycle bin by using the following CLSID.
fr: Ouvre le bac de recyclage en utilisant le CLSID suivant.

source: The rootpath to empty - if omitted the recycle bin for all drives is emptied.
fr: Le chemin de la racine à vider - si il est omis, les corbeilles de tous les lecteurs sont vidées.

source: 0 (the recycle bin cannot be emptied - see below).
fr: Retourne 0 (la corbeille ne peut être vidé - Consultez ci-dessous).

source: For this function to work IE4+ must be available.
fr: Pour que cette fonction puisse fonctionner IE4+ doit être disponible.

source: Display a message box asking whether or not you would like to delete files in the recycle bin.
fr: Affiche une boîte de message vous demandant si vous souhaitez supprimer des fichiers dans la corbeille.

source: Delete files in the recycle bin.
fr: Supprime les fichiers dans la corbeille.

source: This is for the @HomeDrive only, which is generally the C:\ drive.
fr: C'est pour le lecteur principal seulement, qui est généralement le lecteur C:\.

source: Display a message of whether the recycle bin was emptied successfuly.
fr: Affiche un message si la corbeille a été vidée avec succès.

source: $FD_PROMPTOVERWRITE (16) = Prompt to OverWrite File
fr: $FD_PROMPTOVERWRITE (16) = Invite à écraser le fichier

source: File name to suggest to the user to save the file with.
fr: Nom de fichier à suggérer à l'utilisateur pour l'enregistrement.

source: the full path of the file chosen.
fr: Retourne le chemin complet du fichier choisi.

source: Results for multiple selections are "Directory|file1|file2|..."
fr: Le résultat pour les sélections multiples est "Répertoire|fichier1|fichier2|..."

source: Create a constant variable in Local scope of the message to display in FileSaveDialog.
fr: Crée une constante de portée locale avec le message à afficher dans FileSaveDialog.

source: Display a save dialog to select a file.
fr: Affiche une boîte de dialogue Enregistrer pour sélectionner un fichier.

source: Retrieve the filename from the filepath e.g.Example.au3.
fr: Récupére le nom du fichier à partir du chemin complet, par exemple Example.au3.

source: Check if the extension .au3 is appended to the end of the filename.
fr: Vérifiez si l'extension .au3 est ajoutée à la fin du nom de fichier.

source: If a period (dot) is found then check whether or not the extension is equal to .au3.
fr: Si un point est trouvé alors vérifie si l'extension est égale à .au3.

source: If the extension isn't equal to .au3 then append to the end of the filepath.
fr: Si l'extension n'est pas égale à .au3 alors l'ajoute à la fin du chemin du fichier.

source: If no period (dot) was found then append to the end of the file.
fr: Si aucun point n'a été trouvé alors l'ajoute à la fin du fichier.

source: Display the saved file.
fr: Affiche le fichier enregistré.

source: Text greeting in dialog.
fr: Texte du message d'accueil de la boîte de dialogue.

source: Root directory of GUI file tree.
fr: Répertoire racine de l'arborescence de fichiers.

source: It limits a choice in the root folder.Use "" for Desktop to be root.
fr: Utilisez "" pour que le bureau soit le répertoire racine.

source: 1 = Show Create Folder Button (XP only)
fr: 1 = Affiche un bouton de création de dossier (XP seulement)

source: 2 = Use New Dialog Style (XP only)
fr: 2 = Utilise un style de dialogue nouveau (XP seulement)

source: 4 = Show Edit Control (XP only)
fr: 4 = Afficher un contrôle Edit (XP seulement)

source: The full path of the folder you selected/highlighted when displaying dialogue (if it exists in the root folder).Default is blank ("").
fr: Répertoire initial/de départ qui sera choisi s'il existe.Par défaut est vide ("").

source: the full path of the folder chosen.
fr: Retourne le chemin complet du dossier choisi.

source: "" (empty string) and sets the @error flag to 1 if user cancels/closes the window.
fr: Renvoie "" (chaîne vide) et @error = 1 si l'utilisateur annule/ferme la fenêtre.

source: The root dir will be chosen if the initial dir (if given) does not exist.
fr: Le répertoire racine sera choisi si le dossier initial (si donnée) n'existe pas.

source: A nonexistent root dir will also cause the Desktop folder to be root.
fr: Un répertoire racine inexistant entraînera également que le dossier Bureau soit le répertoire racine.

source: UNC paths are not supported.
fr: Les chemins UNC ne sont pas pris en charge.

source: If you think that user's may choose files on a UNC path then the path needs to be mapped as a drive first.
fr: Si vous pensez que l'utilisateur peut avoir besoin de choisir les fichiers sur un chemin UNC, le chemin doit être mappé comme un premier disque.

source: The new vista+ dialog style is used if possible, regardless of the Use New Dialog Style flag.
fr: Le nouveau style de dialogue de Vista+ est utilisé si possible, suivant le flag Use New Dialog Style.

source: With the vista dialog style the edit control and create folder buttons are always shown, ignoring the flags parameter, and the dialog text parameter sets the title of the window.
fr: Avec le style de dialogue de Vista le contrôle edit et les boutons de création de dossier sont toujours affichés, ignorant les paramètres flag, et le paramètre texte du dialogue définit le titre de la fenêtre.

source: Create a constant variable in Local scope of the message to display in FileSelectFolder.
fr: Crée une constante de portée locale avec le message à afficher dans FileSelectFolder.

source: Display the selected folder.
fr: Affiche le dossier sélectionné.

source: The path of the file(s) to set, e.g.C:\*.au3, C:\Dir.
fr: Fichier(s) à changer, par exemple C:\*.au3, C:\dir

source: Attribute(s) to set/clear.
fr: Attribut(s) à définir/effacer.

source: e.g."+A", "+RA-SH"
fr: Par exemple " A", "+RA-SH"

source: If this is set to 1, then directories are recursed into.
fr: Si ce paramètre est réglé à 1, alors les répertoires sont recursifs.

source: Default is 0 (no recursion).
fr: Par défaut est 0 (pas de récursion).

source: 0 if encountered any errors.
fr: Retourne 0 si des erreurs sont apparues.

source: The file pattern cannot contain spaces!
fr: Le motif du fichier ne peut pas contenir d'espaces!

source: The attributes that can be modified with the function are + or -:
fr: Les attributs qui peuvent être modifiés avec la fonction sont + ou -:

source: (Note that you cannot set the compressed/directory attributes with this function.)
fr: (Notez que vous ne pouvez pas définir les attributs compressé et répertoire avec cette fonction.)

source: Mark all .au3 files in current directory as read-only and system.
fr: Marque tous les fichiers .au3 dans le répertoire courant comme en lecture seule et système.

source: Mark all .bmp files in @HomeDrive and sub-directories writable and archived.
fr: Marque tous les fichiers .bmp dans @HomeDrive et dans les sous-répertoires en écriture libre et archivés.

source: The offset to move from the origin.
fr: Le décalage pour déplacer à partir de l'origine.

source: This value may be positive or negative.
fr: Cette valeur peut être positive ou négative.

source: Negative values move backwards from the origin.
fr: Les valeurs négatives déplacent vers l'arrière de l'origine.

source: Must be one of the following:
fr: Doit être l'un des suivants:

source: $FILE_BEGIN (0) = Beginning of the file.
fr: $FILE_BEGIN (0) - Début du fichier.

source: $FILE_CURRENT (1) = Current position.
fr: $FILE_CURRENT (1) - Position actuelle.

source: $FILE_END (2) = End of the file.
fr: $FILE_END (2) - Fin de fichier.

source: True if the operation succeeded.
fr: Retourne True si l'opération a réussi.

source: Include Constants.au3 in your script to use the symbolic name in parentheses to specify the origin.
fr: Inclure Constants.au3 dans votre script pour utiliser le nom symbolique entre parenthèses pour préciser l'origine.

source: Using FileSetPos() it is possible to both read and write to the same file.
fr: En utilisant FileSetPos() il est possible de lire et écrire sur le même fichier.

source: When attempting to read and write to the same file, always call FileFlush() between each write and read operation.
fr: Lorsque vous tentez de lire et d'écrire sur le même fichier, toujours utiliser FileFlush() entre chaque opération de lecture et d'écriture.

source: Moving the pointer to the middle of the data can be used to overwrite data.
fr: Déplacer le pointeur vers le milieu des données peut être utilisé pour écraser les données.

source: The path of the file(s) to set, e.g.
fr: Le chemin des Fichier(s) à modifier, ex :

source: (* and ?
fr: ( caractères spéciaux * et ?

source: The new time to set in the format "YYYYMMDDHHMMSS" (Year, month, day, hours (24hr clock), seconds).
fr: La nouvelle date et heure à attribuer au format "YYYYMMDDHHMMSS" (Année, mois, jour, heures (au format 24hr), secondes).

source: If the time is blank "" then the current time is used.
fr: Si time est vide "" alors la date et l'heure en cours est utilisée.

source: The timestamp to change:
fr: Horodatage à modifier:

source: 0 if error changing timestamp(s).
fr: Retourne 0 en cas d'erreur lors du changement du timestamp.

source: Using a date earlier than 1980-01-01 will have no effect.
fr: Utiliser une date antérieure au 01/01/1980 n'aura aucun effet.

source: Trying to change a timestamp on read-only files will result in an error.
fr: Le changement de la date d'un fichier en lecture seule provoquera une erreur.

source: Alternatively, you may use a string filename as the first parameter.
fr: Alternativement, vous pouvez utiliser le nom et le chemin du fichier comme premier paramètre.

source: The text/data to write to the file.
fr: Le texte/les données à écrire dans le fichier.

source: The text is written as is - no @CR or @LF characters are added.
fr: Le texte est écrit tel quel - aucuns @CR ou @LF ne sont ajoutés.

source: See remark for data type.
fr: Consultez Remarques pour le type de données.

source: 0 if file not opened in writemode, file is read only, or file cannot otherwise be written to.
fr: Retourne 0 si le fichier n'est pas ouvert en écriture, si le fichier est en lecture seule, ou si le fichier ne peut être écrit autrement.

source: The file must be opened in write mode or the FileWrite() command will fail.
fr: Le fichier doit être ouvert en écriture, sinon la commande FileWrite() échouera.

source: If a filename is given rather than a file handle, the file will be opened and closed during the function call.
fr: Si un nom de fichier est donné plutôt qu'un handle de fichier, celui-ci sera ouvert puis fermé durant l'appel de la fonction.

source: For parsing large text files this will be much slower than using filehandles.
fr: Pour un traitement sur de grands fichiers texte ceci sera beaucoup plus lent que d'utiliser un handle de fichier.

source: However, filename will be created if it does not already exist.
fr: Ceci dit, le fichier sera créé s'il n'existe pas déjà.

source: Either use filehandles or filenames in your routines, not both.
fr: Utilisez les handles ou les noms de fichiers dans votre routine, mais pas les deux.

source: When writing text AutoIt will write using ANSI by default.
fr: Lors de l'écriture d'un texte, AutoIt utilise la norme ANSI par défaut.

source: To write in Unicode mode the file must be opened with FileOpen() and the relevant flags.
fr: Pour écrire en mode Unicode, le fichier doit être ouvert avec FileOpen() et les paramètres appropriés.

source: If the data is a binary type variant (and not text) it will be written to the file byte by byte.
fr: Si les données sont une variante de type binaire (et non du texte), il sera écrit dans le fichier octet par octet.

source: Binary operation can also be forced by using FileOpen() with the binary flag.
fr: Une opération binaire peut aussi être forcée en utilisant FileOpen() avec le paramètre binaire.

source: Create a temporary file to write data to.
fr: Crée un fichier temporaire pour écrire des données.

source: Open the file for writing (append to the end of a file) and store the handle to a variable.
fr: Ouvre le fichier en écriture (ajoute à la fin d'un fichier) et stocke le handle dans une variable.

source: The line of text to write to the text file.
fr: La ligne de texte à écrire dans le fichier.

source: If the line does NOT end in @CR or @LF then a DOS linefeed (@CRLF) will be automatically added.
fr: Si la ligne ne se termine pas par @CR ou @LF, un saut de ligne DOS (@CRLF) sera automatiquement ajouté.

source: The text file must be opened in write mode or the FileWriteLine() command will fail.
fr: Le fichier texte doit être ouvert en writemode ou la commande FileWriteLine() va échouer.

source: The text to write cannot contain Chr(0) characters as the output is truncated.
fr: Le texte à écrire ne peut pas contenir Chr(0) comme la sortie est tronquée.

source: FileWrite() using a file opened in binary mode must be used to write such characters.
fr: FileWrite() utilisant un fichier ouvert en mode binaire doit être utilisé pour écrire ces caractères.

source: Returns a number rounded down to the closest integer.
fr: Retourne un nombre arrondi à l'entier inférieur le plus proche.

source: Loop through the array: calculate the floor and format the result.
fr: Boucle dans le tableau : calcule 'floor' et formate le résultat.

source: FTPEx user defined functions Reference
fr: FTPEx - Référence

source: When using them you need to add a #include <FTPEx.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <FTPEx.au3>.

source: Sets the internet proxy to use for ftp access.
fr: Configure le proxy internet pour l'accès FTP.

source: The proxy mode to use:
fr: Le mode de proxy à utiliser :

source: 0 = (default) Use current Internet Explorer settings for proxy.
fr: 0 = (défaut) Utilise les paramètres en cours d'Internet Explorer pour le proxy.

source: 1 = Use no proxy (direct access)
fr: 1 = N'utilise pas de proxy (accès direct).

source: 2 = Use the proxy specified
fr: 2 = Utilise le proxy spécifié.

source: The address and port of the proxy to use.
fr: L'adresse et le port du proxy à utiliser.

source: If required, the username for the proxy
fr: Si nécessaire, le nom d'utilisateur pour le proxy.

source: If required, the password for the proxy
fr: Si nécessaire, le mot de passe pour le proxy.

source: Internet Explorer 3 or greater must be installed for this function to work.
fr: Internet Explorer 3 ou plus récent doit être installé pour faire fonctionner la fonction FtpSetProxy().

source: Only CERN proxy servers are supported.
fr: Seuls les serveurs proxy CERN (W3C) sont pris en charge.

source: Proxy servers are usually made up of a web address and port number.
fr: Les serveurs proxy sont habituellement définis par une adresse et un numéro de port.

source: Most ISPs use the port number of 8080.
fr: La plupart des prestataires utilisent le port 8080.

source: If your proxy was "www.proxy.com" and port was "8080" then you would use this to set the proxy:
fr: Si votre proxy est "www.proxy.com" et le port est 8080 alors, vous utiliserez les paramètres suivants :

source: Most proxy servers do not require a username and password.
fr: La plupart des serveurs proxy ne nécessites ni nom d'utilisateur ni mot de passe.

source: When using mode 0 you may specify a username and password and these will be used with the Internet Explorer configured proxy.
fr: En utilisant le mode 0, vous pouvez spécifier un nom d'utilisateur et un mot de passe qui seront utilisé avec le proxy configuré dans Internet Explorer.

source: Use no proxy
fr: N'utilise pas de proxy

source: Use IE defaults for proxy
fr: Utilise les valeurs par défaut d'IE pour un proxy

source: Use the proxy "www-cache.myisp.net" on port 8080
fr: Utilise le proxy "www-cache.myisp.net" sur le port 8080

source: Returns the name of a function stored in a variable.
fr: Retourne le nom d'une fonction stockée dans une variable.

source: A variable containing a Function whose name you want to retrieve.
fr: Une variable contenant une Function dont vous voulez obtenir le nom.

source: a string containing the name of the function.
fr: Retourne une chaîne contenant le nom de la function.

source: Create a first class object of MsgBox and assign to a Local variable.
fr: Crée un premier objet de la classe de MsgBox et l'assigne à une variable locale.

source: Display a MsgBox using the previously assigned variable.
fr: Affiche une MsgBox en utilisant la variable précédemment assignée.

source: Display a MsgBox that shows the function name $hMsgBox.
fr: Affiche une MsgBox qui indique le nom de la fonction $hMsgBox.

source: Activation user defined functions Reference
fr: Activation - Référence

source: When using them you need to add a #include <GDIPlus.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GDIPlus.au3>.

source: ArrowCap user defined functions Reference
fr: ArrowCap - Référence

source: Bitmap user defined functions Reference
fr: Bitmap - Référence

source: Brush user defined functions Reference
fr: Brush - Référence
